Documents/ПисьмоОбменСБанками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПисьмоОбменСБанками</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Банк</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.БанкОбменСБанками</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПисьма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПисемОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьВложение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецОбменСБанками</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетОрганизации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СчетОрганизацииОбменСБанками</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбменСБанками</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляВалютногоКонтроля</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПереписки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсходящийНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторИсходногоПисьма</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/НаправленияЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>НаправленияЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интеркампани</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренний</Name>
					<Comment>Внутри организации</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПисьмоОбменСБанками/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Письмо
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ПисьмоОбменСБанками";
	КомандаПечати.Идентификатор = "ПисьмоОбменСБанками";
	КомандаПечати.Представление = НСтр("ru = 'Печать'");
	КомандаПечати.Картинка = БиблиотекаКартинок.Печать;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив из ДокументСсылка.ПисьмоОбменСБанками
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений из ДокументСсылка.ПисьмоОбменСБанками
//   Представление списка - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПисьмоОбменСБанками") Тогда
		ТабличныйДокумент = СформироватьПисьмо(МассивОбъектов, ОбъектыПечати);
		КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
		НазваниеМакета = СтрШаблон("Документ.ПисьмоОбменСБанками.ПФ_MXL_Письмо_%1", КодОсновногоЯзыка);
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПисьмоОбменСБанками",
			НСтр("ru='Письмо'"), ТабличныйДокумент, , НазваниеМакета);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Направление = ПредопределенноеЗначение("Перечисление.НаправленияЭДО.Входящий") Тогда
		Шаблон = НСтр("ru = 'Входящее письмо из банка №%1 от %2'");
		Номер = Данные.ВходящийНомер;
	Иначе
		Шаблон = НСтр("ru = 'Исходящее письмо в банк №%1 от %2'");
		Если ЗначениеЗаполнено(Данные.ИсходящийНомер) Тогда
			Номер = Строка(Данные.ИсходящийНомер);
		Иначе
			Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Данные.Номер);
		КонецЕсли;
	КонецЕсли;
	
	Представление = СтрШаблон(Шаблон, Номер, Данные.Дата);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Направление");
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ВходящийНомер");
	Поля.Добавить("ИсходящийНомер");
	
КонецПроцедуры

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаДокумент = Неопределено;
	Если Параметры.Свойство("Ключ", СсылкаНаДокумент) Тогда
		Направление = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаДокумент, "Направление");
		Если Направление = Перечисления.НаправленияЭДО.Входящий Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "ПисьмоИзБанка";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Формирует печатную форму письма для обмена с банками.
//
// Параметры:
//   ПисьмоОбменСБанками - ДокументСсылка.ПисьмоОбменСБанками - ссылка на документ
//
// Возвращаемое значение:
//   ТабличныйДокумент - сформированная печатная форма письма
//
Функция ПечатнаяФормаПисьма(ПисьмоОбменСБанками) Экспорт
	
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПисьмоОбменСБанками);
	ОбъектыПечати = Новый СписокЗначений;
	ТабличныйДокумент = СформироватьПисьмо(МассивОбъектов, ОбъектыПечати);
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьПисьмо(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ПисьмоОбменСБанками";
	КодОсновногоЯзыка = ОбщегоНазначения.КодОсновногоЯзыка();
	НазваниеМакета = СтрШаблон("Документ.ПисьмоОбменСБанками.ПФ_MXL_Письмо_%1", КодОсновногоЯзыка);
	Макет = УправлениеПечатью.МакетПечатнойФормы(НазваниеМакета);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПисьмоОбменСБанками.Номер КАК Номер,
	               |	ПисьмоОбменСБанками.Дата КАК Дата,
	               |	ПисьмоОбменСБанками.Организация КАК Организация,
	               |	ПисьмоОбменСБанками.Банк КАК Банк,
	               |	ПисьмоОбменСБанками.Тема КАК Тема,
	               |	ПисьмоОбменСБанками.ТипПисьма КАК ТипПисьма,
	               |	ПисьмоОбменСБанками.Текст КАК Текст,
	               |	ПисьмоОбменСБанками.Направление КАК Направление,
	               |	ПисьмоОбменСБанками.ВходящийНомер КАК ВходящийНомер,
	               |	ПисьмоОбменСБанками.ВходящаяДата КАК ВходящаяДата,
	               |	ПисьмоОбменСБанками.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПисьмоОбменСБанками КАК ПисьмоОбменСБанками
	               |ГДЕ
	               |	ПисьмоОбменСБанками.Ссылка В(&МассивДокументов)";
	Запрос.УстановитьПараметр("МассивДокументов", МассивОбъектов);
		
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьПечати = Макет.ПолучитьОбласть("Шапка");
		Если Выборка.Направление = Перечисления.НаправленияЭДО.Входящий Тогда   
			ОбластьПечати.Параметры.Направление = "Входящее";
			ОбластьПечати.Параметры.Дата = Формат(Выборка.ВходящаяДата,"ДЛФ=DD");
			ОбластьПечати.Параметры.Номер = Выборка.ВходящийНомер;
			ОбластьПечати.Параметры.Отправитель = Выборка.Банк;
			ОбластьПечати.Параметры.Получатель = Выборка.Организация;
		Иначе 
			ОбластьПечати.Параметры.Направление = "Исходящее";
			ОбластьПечати.Параметры.Дата = Формат(Выборка.Дата,"ДЛФ=DD");
			ОбластьПечати.Параметры.Номер = ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(Выборка.Номер);
			ОбластьПечати.Параметры.Отправитель = Выборка.Организация;
			ОбластьПечати.Параметры.Получатель = Выборка.Банк;
		КонецЕсли;   
		ОбластьПечати.Параметры.Тема = Выборка.Тема;
		ТабличныйДокумент.Вывести(ОбластьПечати);   
		
		Если ЗначениеЗаполнено(Выборка.ТипПисьма) Тогда		
			ОбластьПечати = Макет.ПолучитьОбласть("ТипПисьма");  
			ОбластьПечати.Параметры.ТипПисьма = Выборка.ТипПисьма;
			ТабличныйДокумент.Вывести(ОбластьПечати);   
		КонецЕсли;  
		
		ОбластьПечати = Макет.ПолучитьОбласть("ТекстПисьма");  
		ОбластьПечати.Параметры.Текст = Выборка.Текст;
		ТабличныйДокумент.Вывести(ОбластьПечати);   
			
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабличныйДокумент,
			НомерСтрокиНачало,
			ОбъектыПечати,
			Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
